YamaTornado/Basis-Justin/firmware/sdkconfig.defaults
# Target: ESP32-S3-FH4R2 (4 MB flash, 2 MB PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Custom partition table, see partitions.csv (adds the raw flight_log
# partition used by components/drivers/flash_log).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# FH4R2 has 2 MB of quad SPI PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y

# FreeRTOS tick rate: 1000 Hz gives 1ms scheduling resolution, useful for
# the 100 Hz sensor/estimator/flight tasks (see docs/ARCHITECTURE.md).
CONFIG_FREERTOS_HZ=1000

# esp_timer_get_time() is used as the single time source across all tasks
# (sensor timestamps, flight_state debounce timers, log timestamps).
CONFIG_ESP_TIMER_TASK_STACK_SIZE=2048

# Keep boot log output on UART0 usable for early debugging.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
